#if !defined(___INPUT___H)
#define ___INPUT___H

/********************************************************
	インクルードファイル
********************************************************/

/********************************************************
	マクロ定義
********************************************************/

#define KEY_UP      (1 << 0)									//	キー入力用情報ビット（g_nKeyData）
#define KEY_DOWN    (1 << 1)
#define KEY_LEFT    (1 << 2)
#define KEY_RIGHT   (1 << 3)
#define KEY_ROTL	(1 << 4)
#define KEY_ROTR	(1 << 5)
#define KEY_BUTTON1 (1 << 6)
#define KEY_BUTTON2 (1 << 7)
#define KEY_ENTER	(1 << 8)
#define KEY_ESC		(1 << 9)

/********************************************************
	グローバル変数宣言
********************************************************/

extern int g_nKeyData;											//	リアルタイムなキー情報
extern int g_nKeyEdgeData;										//	キーのエッジ情報

/********************************************************
	関数プロトタイプ宣言
********************************************************/

void Input_Device( void );

#endif	// #if !defined(___??___?)
