
/************************************************
	ヘッダーファイル
************************************************/

#include "main.h"

/************************************************
	名前空間
************************************************/

using namespace std;

/************************************************
	メイン関数
************************************************/

void main( int argc, char* atgv[] )
{

	// キー入力用
	int key = 0;

	CNetWork *cnet;

	// ネットワーククラスのインスタンスを作る
	cnet = new CNetWork();

	if ( cnet != NULL ) {

		// 接続要求の受け付け開始
		cnet->ListenStart();

		// Escキーが押されたら終了（が現在ESCキーでは終了しない）
		do {

			// キー情報を取得
			key = _getch();

		} while ( key != 27 );

		delete(cnet);

	}

}
